wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"

#include <stdio.h>
#include <string.h>

#include "fatfs.h"
#include "ff.h"
#include "diskio.h"
#include "bsp_driver_sd.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "lwip/netifapi.h"
#include "lwip/apps/sntp.h"
#include "ethernetif.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


#define APP_SEPARATOR_X              280U

#define APP_MILK_BUTTON_WIDTH         84U
#define APP_MILK_BUTTON_HEIGHT        52U

#define APP_MILK_BUTTON_X1           290U
#define APP_MILK_BUTTON_X2           386U

#define APP_MILK_BUTTON_Y1            30U
#define APP_MILK_BUTTON_Y2           105U
#define APP_MILK_BUTTON_Y3           180U

#define APP_RECORD_X                  10U
#define APP_RECORD_Y                  88U
#define APP_RECORD_WIDTH             260U
#define APP_RECORD_HEIGHT            185U
#define APP_RECORD_LINE_HEIGHT        22U

#define APP_HISTORY_MAX_RECORDS      256U
#define APP_RECORDS_PER_PAGE           8U
#define APP_RECORD_TEXT_LENGTH        32U
#define APP_TOUCH_DEBOUNCE_MS        200U
#define APP_HISTORY_SWIPE_PIXELS       35U
#define APP_DELETE_X                  290U
#define APP_DELETE_Y                  240U
#define APP_DELETE_WIDTH              180U
#define APP_DELETE_HEIGHT              28U
#define APP_MENU_BUTTON_WIDTH         190U
#define APP_MENU_BUTTON_HEIGHT         65U
#define APP_MENU_LEFT_X                30U
#define APP_MENU_RIGHT_X              260U
#define APP_MENU_TOP_Y                 75U
#define APP_MENU_BOTTOM_Y             165U
#define APP_SYNC_CANCEL_X             170U
#define APP_SYNC_CANCEL_Y             185U
#define APP_SYNC_CANCEL_WIDTH         140U
#define APP_SYNC_CANCEL_HEIGHT         55U

#define RTC_INIT_MAGIC             0x32F3U

#define SET_MINUS_X          10U
#define SET_PLUS_X           125U
#define SET_NEXT_X           240U
#define SET_SAVE_X           355U

#define SET_BUTTON_Y         180U
#define SET_BUTTON_WIDTH     110U
#define SET_BUTTON_HEIGHT     60U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

static TS_StateTypeDef appTouchState;

typedef struct
{
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
    uint16_t amountMl;
    const char *label;
} APP_MilkButtonTypeDef;


typedef struct
{
    uint16_t year;

    uint8_t month;
    uint8_t day;

    uint8_t hour;
    uint8_t minute;
    uint8_t second;

    uint16_t amountMl;
    uint32_t sourceOrdinal;
} APP_MilkRecordTypeDef;


/*
 * 右侧六个按钮。
 */
static const APP_MilkButtonTypeDef appMilkButtons[] =
{
    {
        APP_MILK_BUTTON_X1,
        APP_MILK_BUTTON_Y1,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        30U,
        "30ml"
    },
    {
        APP_MILK_BUTTON_X2,
        APP_MILK_BUTTON_Y1,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        50U,
        "50ml"
    },
    {
        APP_MILK_BUTTON_X1,
        APP_MILK_BUTTON_Y2,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        90U,
        "90ml"
    },
    {
        APP_MILK_BUTTON_X2,
        APP_MILK_BUTTON_Y2,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        100U,
        "100ml"
    },
    {
        APP_MILK_BUTTON_X1,
        APP_MILK_BUTTON_Y3,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        110U,
        "110ml"
    },
    {
        APP_MILK_BUTTON_X2,
        APP_MILK_BUTTON_Y3,
        APP_MILK_BUTTON_WIDTH,
        APP_MILK_BUTTON_HEIGHT,
        120U,
        "120ml"
    }
};

#define APP_MILK_BUTTON_COUNT \
    ((uint8_t)(sizeof(appMilkButtons) / sizeof(appMilkButtons[0])))


static APP_MilkRecordTypeDef appMilkRecords[APP_HISTORY_MAX_RECORDS];

static uint16_t appRecordCount = 0U;
static uint16_t appHistoryPage = 0U;
static int16_t appSelectedRecordIndex = -1;
static uint32_t appCsvRecordCount = 0U;
static uint32_t appTodayTotalMl = 0U;

static uint16_t appTodayYear = 0U;
static uint8_t appTodayMonth = 0U;
static uint8_t appTodayDay = 0U;

