wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    osThreadDef(EthLink, ethernet_link_thread, osPriorityNormal, 0,
                configMINIMAL_STACK_SIZE * 2U);
    (void)osThreadCreate(osThread(EthLink), &appNetif);
    (void)netifapi_dhcp_start(&appNetif);
    appNetworkInitialized = 1U;
}

static uint8_t APP_SyncCancelRequested(void)
{
    TS_StateTypeDef state = {0};

    if ((BSP_TS_GetState(&state) == TS_OK) &&
        (state.touchDetected > 0U) &&
        (APP_PointInRect(state.touchX[0], state.touchY[0],
                         APP_SYNC_CANCEL_X, APP_SYNC_CANCEL_Y,
                         APP_SYNC_CANCEL_WIDTH,
                         APP_SYNC_CANCEL_HEIGHT) != 0U))
    {
        return 1U;
    }
    return 0U;
}

static uint8_t APP_SyncNetworkTime(void)
{
    uint32_t started;
    TS_StateTypeDef state = {0};

    APP_NetworkInit();

    /* Do not treat the menu tap that opened this page as CANCEL. */
    do
    {
        (void)BSP_TS_GetState(&state);
        osDelay(20U);
    } while (state.touchDetected > 0U);

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(0U, 145U,
        (uint8_t *)"Waiting for cable / DHCP...", CENTER_MODE);

    started = HAL_GetTick();
    while ((HAL_GetTick() - started) < 20000U)
    {
        if (APP_SyncCancelRequested() != 0U)
        {
            return 2U;
        }
        if (netif_is_link_up(&appNetif) &&
            !ip4_addr_isany_val(*netif_ip4_addr(&appNetif)))
        {
            break;
        }
        osDelay(100U);
    }

    if (!netif_is_link_up(&appNetif) ||
        ip4_addr_isany_val(*netif_ip4_addr(&appNetif)))
    {
        return 0U;
    }

    {
        char ipText[40];
        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        BSP_LCD_FillRect(0U, 140U, BSP_LCD_GetXSize(), 25U);
        snprintf(ipText, sizeof(ipText), "IP %s - contacting NTP",
                 ip4addr_ntoa(netif_ip4_addr(&appNetif)));
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_DisplayStringAt(0U, 145U,
                                (uint8_t *)ipText, CENTER_MODE);
    }

    appTimeSynchronized = 0U;
    sntp_stop();
    sntp_setoperatingmode(SNTP_OPMODE_POLL);
    sntp_setservername(0U, "pool.ntp.org");
    sntp_init();

    started = HAL_GetTick();
    while (((HAL_GetTick() - started) < 15000U) &&
           (appTimeSynchronized == 0U))
    {
        if (APP_SyncCancelRequested() != 0U)
        {
            sntp_stop();
            return 2U;
        }
        osDelay(100U);
    }
    return appTimeSynchronized;
}

static void APP_BootMenu(void)
{
    TS_StateTypeDef state = {0};
    uint8_t previous = 0U;
    char connectionStatus[64];

    for (;;)
    {
        BSP_LCD_Clear(LCD_COLOR_WHITE);
        BSP_LCD_SetFont(&Font24);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_DisplayStringAt(0U, 20U,
            (uint8_t *)"MILK LOG", CENTER_MODE);

        APP_DrawSetupButton(APP_MENU_LEFT_X, APP_MENU_TOP_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "START");
        APP_DrawSetupButton(APP_MENU_RIGHT_X, APP_MENU_TOP_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "SET TIME");
        APP_DrawSetupButton(APP_MENU_LEFT_X, APP_MENU_BOTTOM_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "SYNC TIME");
        APP_DrawSetupButton(APP_MENU_RIGHT_X, APP_MENU_BOTTOM_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "CLEAR HISTORY");

        BSP_LCD_SetFont(&Font16);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        if (appNetworkInitialized == 0U)
        {
            snprintf(connectionStatus, sizeof(connectionStatus),
                     "%s   NET: OFF",
                     (appSdReady != 0U) ? "SD: OK" : "SD: ERROR");
            BSP_LCD_SetTextColor(LCD_COLOR_DARKYELLOW);
        }
        else if (!netif_is_link_up(&appNetif))
        {
            snprintf(connectionStatus, sizeof(connectionStatus),
                     "%s   NET: NO CABLE",
                     (appSdReady != 0U) ? "SD: OK" : "SD: ERROR");
            BSP_LCD_SetTextColor(LCD_COLOR_RED);
        }
        else if (ip4_addr_isany_val(*netif_ip4_addr(&appNetif)))
        {
            snprintf(connectionStatus, sizeof(connectionStatus),
                     "%s   NET: DHCP...",
                     (appSdReady != 0U) ? "SD: OK" : "SD: ERROR");
            BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
        }
        else
        {
            snprintf(connectionStatus, sizeof(connectionStatus),
                     "%s   NET: %s",
                     (appSdReady != 0U) ? "SD: OK" : "SD: ERROR",
                     ip4addr_ntoa(netif_ip4_addr(&appNetif)));
            BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
        }
        BSP_LCD_DisplayStringAt(0U, 245U,
            (uint8_t *)connectionStatus, CENTER_MODE);

        do
        {
            (void)BSP_TS_GetState(&state);
            osDelay(20U);
        } while (state.touchDetected > 0U);
        previous = 0U;
        for (;;)
        {
            if (BSP_TS_GetState(&state) == TS_OK)
            {
                uint8_t touching = (state.touchDetected > 0U) ? 1U : 0U;
                if ((touching != 0U) && (previous == 0U))
                {
                    uint16_t x = state.touchX[0];
                    uint16_t y = state.touchY[0];
                    if (APP_PointInRect(x, y, APP_MENU_LEFT_X,
                            APP_MENU_TOP_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        return;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_RIGHT_X,
                            APP_MENU_TOP_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        APP_TimeSetupScreen();
                        break;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_LEFT_X,
                            APP_MENU_BOTTOM_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        uint8_t synced;
                        BSP_LCD_Clear(LCD_COLOR_WHITE);
                        BSP_LCD_SetFont(&Font20);
                        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
                        BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
                        BSP_LCD_DisplayStringAt(0U, 110U,
                            (uint8_t *)"CONNECTING / SYNCING...",
                            CENTER_MODE);
                        APP_DrawSetupButton(APP_SYNC_CANCEL_X,
                            APP_SYNC_CANCEL_Y, APP_SYNC_CANCEL_WIDTH,
                            APP_SYNC_CANCEL_HEIGHT, "CANCEL");
                        synced = APP_SyncNetworkTime();
                        BSP_LCD_Clear(LCD_COLOR_WHITE);
                        BSP_LCD_SetTextColor((synced == 1U) ?
                                             LCD_COLOR_GREEN :
                                             ((synced == 2U) ?
                                              LCD_COLOR_ORANGE :
                                              LCD_COLOR_RED));
                        BSP_LCD_DisplayStringAt(0U, 110U,
                            (uint8_t *)((synced == 1U) ?
                                "TIME SYNCED" :
                                ((synced == 2U) ?
                                 "SYNC CANCELLED" : "SYNC FAILED")),
                            CENTER_MODE);
                        osDelay(1200U);
                        break;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_RIGHT_X,
                            APP_MENU_BOTTOM_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        if ((APP_ConfirmClearHistory() != 0U) &&
                            (APP_ClearAllHistory() == FR_OK))
                        {
                            BSP_LCD_Clear(LCD_COLOR_WHITE);
                            BSP_LCD_SetFont(&Font20);
                            BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
                            BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
                            BSP_LCD_DisplayStringAt(0U, 110U,
                                (uint8_t *)"HISTORY CLEARED", CENTER_MODE);
                            osDelay(800U);
                        }
                        break;
                    }
                }
                previous = touching;
            }
            osDelay(20U);
        }
    }
}

static void APP_Init(void)
{
    FRESULT sdResult;
    /*
     * 初始化 LCD。
     */
    if (BSP_LCD_Init() != LCD_OK)
    {
        Error_Handler();
    }

