wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    BSP_LCD_DisplayStringAt(
        APP_RECORD_X,
        8U,
        (uint8_t *)text,
        LEFT_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "Total:%lu ml  Feeds:%u",
        (unsigned long)displayTotal,
        (unsigned int)displayFeeds
    );

    BSP_LCD_DisplayStringAt(
        APP_RECORD_X,
        29U,
        (uint8_t *)text,
        LEFT_MODE
    );

    if (displayLast != NULL)
    {
        snprintf(text, sizeof(text), "Last: %02u:%02u  %u ml",
                 displayLast->hour, displayLast->minute,
                 displayLast->amountMl);
    }
    else
    {
        snprintf(text, sizeof(text), "Last: --:--  -- ml");
    }
    BSP_LCD_DisplayStringAt(APP_RECORD_X, 50U,
                            (uint8_t *)text, LEFT_MODE);

    if (appHistoryPage == 0U)
    {
        snprintf(text, sizeof(text), "TODAY RECORDS");
    }
    else
    {
        snprintf(text, sizeof(text), "HISTORY  Page %u/%u",
                 (unsigned int)appHistoryPage,
                 (unsigned int)(totalPages - 1U));
    }
    BSP_LCD_DisplayStringAt(APP_RECORD_X, 69U, (uint8_t *)text, LEFT_MODE);

    for (i = 0U; i < (endIndex - firstIndex); i++)
    {
        uint16_t recordIndex = (uint16_t)(endIndex - 1U - i);

        BSP_LCD_SetBackColor(
            ((int16_t)recordIndex == appSelectedRecordIndex) ?
            LCD_COLOR_YELLOW : LCD_COLOR_WHITE);
        snprintf(
            text,
            sizeof(text),
            "%02u-%02u %02u:%02u  %3u ml",
            appMilkRecords[recordIndex].month,
            appMilkRecords[recordIndex].day,
            appMilkRecords[recordIndex].hour,
            appMilkRecords[recordIndex].minute,
            appMilkRecords[recordIndex].amountMl
        );

        BSP_LCD_DisplayStringAt(
            APP_RECORD_X,
            APP_RECORD_Y +
                (i *
                 APP_RECORD_LINE_HEIGHT),
            (uint8_t *)text,
            LEFT_MODE
        );
    }

    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
}

static void APP_DrawDeleteButton(void)
{
    uint32_t color = (appSelectedRecordIndex >= 0) ?
        LCD_COLOR_RED : LCD_COLOR_GRAY;

    BSP_LCD_SetTextColor(color);
    BSP_LCD_FillRect(APP_DELETE_X, APP_DELETE_Y,
                     APP_DELETE_WIDTH, APP_DELETE_HEIGHT);
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(color);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    BSP_LCD_DisplayStringAt(APP_DELETE_X + 57U, APP_DELETE_Y + 5U,
                            (uint8_t *)"DELETE", LEFT_MODE);
}

static void APP_DrawMilkButton(
    uint8_t buttonIndex,
    uint8_t pressed)
{
    const APP_MilkButtonTypeDef *button;
    uint32_t backgroundColor;

    uint16_t textWidth;
    uint16_t textX;
    uint16_t textY;

    if (buttonIndex >= APP_MILK_BUTTON_COUNT)
    {
        return;
    }

    button = &appMilkButtons[buttonIndex];

    backgroundColor =
        (pressed != 0U) ?
        LCD_COLOR_DARKBLUE :
        LCD_COLOR_BLUE;

    BSP_LCD_SetTextColor(backgroundColor);

    BSP_LCD_FillRect(
        button->x,
        button->y,
        button->width,
        button->height
    );

    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DrawRect(
        button->x,
        button->y,
        button->width,
        button->height
    );

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(backgroundColor);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    textWidth =
        (uint16_t)(strlen(button->label) *
                   Font16.Width);

    textX =
        button->x +
        ((button->width - textWidth) / 2U);

    textY =
        button->y +
        ((button->height - Font16.Height) / 2U);

    BSP_LCD_DisplayStringAt(
        textX,
        textY,
        (uint8_t *)button->label,
        LEFT_MODE
    );
}


static void APP_DrawAllMilkButtons(void)
{
    uint8_t i;

    for (i = 0U;
         i < APP_MILK_BUTTON_COUNT;
         i++)
    {
        APP_DrawMilkButton(i, 0U);
    }
}




static void APP_AddMilkRecord(uint16_t amountMl)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    uint16_t currentYear;
    APP_MilkRecordTypeDef record;

    if (HAL_RTC_GetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    if (HAL_RTC_GetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    currentYear = 2000U + rtcDate.Year;

    /*
     * 检测日期是否已经改变。
     */
    if ((currentYear != appTodayYear) ||
        (rtcDate.Month != appTodayMonth) ||
        (rtcDate.Date != appTodayDay))
    {
        appTodayYear = currentYear;
        appTodayMonth = rtcDate.Month;
        appTodayDay = rtcDate.Date;

        appTodayTotalMl = 0U;
        appHistoryPage = 0U;
    }

    record.year = currentYear;
    record.month = rtcDate.Month;
    record.day = rtcDate.Date;
    record.hour = rtcTime.Hours;
    record.minute = rtcTime.Minutes;
    record.second = rtcTime.Seconds;
    record.amountMl = amountMl;

    /* Only show a record after it is safely synchronized to the SD card. */
    if (APP_AppendMilkRecord(&record) != FR_OK)
    {
        return;
    }

    record.sourceOrdinal = ++appCsvRecordCount;
    APP_InsertTodayRecord(&record);
    appHistoryPage = 0U;

    APP_DrawLeftPanel();
}

static void APP_InsertTodayRecord(const APP_MilkRecordTypeDef *record)
{
    uint16_t recordIndex;

    if ((record->year == appTodayYear) &&
        (record->month == appTodayMonth) &&
        (record->day == appTodayDay))
    {
        appTodayTotalMl += record->amountMl;
    }

    if (appRecordCount < APP_HISTORY_MAX_RECORDS)
    {
        recordIndex = appRecordCount++;
    }
    else
    {
        memmove(&appMilkRecords[0], &appMilkRecords[1],
                sizeof(appMilkRecords[0]) *
                    (APP_HISTORY_MAX_RECORDS - 1U));
        recordIndex = APP_HISTORY_MAX_RECORDS - 1U;
    }

